000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID.    HELLO.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
            01 MY-COLORS.
              03 MY-COLOR OCCURS 3 PIC X(10).
000020 PROCEDURE      DIVISION.
000030 MAIN           SECTION.
       MOVE "red" TO MY-COLOR(1).
       MOVE "blue" TO MY-COLOR(2).
       MOVE "yellow" TO MY-COLOR(3).
000040 DISPLAY        MY-COLORS.
000040 DISPLAY        MY-COLOR(2).
000050 STOP           RUN.