000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID.    HELLO.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
            01 MY-DATA1 PIC X(20).
000020 PROCEDURE      DIVISION.
000030 MAIN           SECTION.
       MOVE 'HELLO WORLD!!' TO MY-DATA1.
000040 DISPLAY        MY-DATA1.
000050 STOP           RUN.