000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID.    HELLO.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
          01 MY-SCORE PIC 9(3).
000020 PROCEDURE      DIVISION.
000030 MAIN           SECTION.
            MOVE 40 TO MY-SCORE.
            IF MY-SCORE IS GREATER THAN 60 THEN
            DISPLAY "OK!"
            ELSE 
              DISPLAY "NG!"
            END-IF.
000040 STOP           RUN.