000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID.    HELLO.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
            01 MY-DATA1 PIC X(20).
            01 MY-DATA2 PIC 99999 VALUE 130.
            01 MY-DATA3 PIC 9(5)V9(2).
000020 PROCEDURE      DIVISION.
000030 MAIN           SECTION.
      *  MOVE 120 TO MY-DATA2.
       MOVE 123.42 TO MY-DATA3.
000040 DISPLAY        MY-DATA2.
000050 STOP           RUN.